OpenFOAM-dev/tutorials/multiRegion/film/hotBoxes/0/film/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    surface
    {
        type            mappedFilmPressure;
        value           $internalField;
    }

    wall
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
